Repository: Cameronlroberts/Projects
Catalog: wardenslog/wardens/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Name
cy: Enw

source: banner id
cy: Id Banner

source: surname
cy: Cyfenw

source: forename
cy: Enw cyntaf

source: Site
cy: Safle

source: title
cy: Teitl

source: warden name
cy: Enw Warden

source: senior warden
cy: Uwch Warden

source: Yes
cy: Ia

source: No
cy: Nax

source: disciplinary called by
cy: Gelwir disgyblu gan

source: disciplinary date
cy: Dyddiad disgyblu

source: accomplices
cy: Affeithiwr

source: witnesses
cy: Tystion

source: Wardens Log
cy: Log Wardeiniaid

source: Status
cy: Statws

source: Title
cy: Teitl

source: Date Created
cy: Dyddiad creu

source: Warden Name
cy: Enw Warden

source: View
cy: Golygfa

source: detail
cy: Manylion

source: Date Modified
cy: Dyddiad addaswyd

source: Senior Warden
cy: Uwch Warden

source: Halls
cy: Neuaddau

source: Incident Type
cy: Natur y digwyddiad

source: Description
cy: Disgrifiad

source: Notes To
cy: Nodiadau i

source: Notes By
cy: Nodiadau gan

source: Warning Issued
cy: Rhybudd cyhoeddi

source: Disciplinary required
cy: Camau disgyblu eu hangen

source: Disciplinary called by
cy: Gelwir disgyblu gan

source: Disciplinary date
cy: Dyddiad disgyblu

source: Student
cy: Myfyriwr

source: Accomplices
cy: Affeithiwr

source: Complainant
cy: Achwynydd

source: Witnesses
cy: Tystion

source: Create Report
cy: Creu Adroddiad

source: Submit
cy: Cyflwyno

source: Disciplinary Required
cy: Disgyblu ofynnol

source: this is the logout page
cy: Dyma'r dudalen allgofnodi

source: should you wish to log back in please click the button below to navigate back to the login page
cy: os hoffech fewngofnodi eto cliciwch ar y botwm isod i lywio nol ir tudalen login

source: Homepage
cy: Hafan

source: Incident Report
cy: Adroddiad Digwyddiad

source: Disciplinary Taken
cy: Disgyblu a cymerud

source: Cases
cy: Achosion
